{
    "Calcium":{
        "key": "1",
        "name": "Calcium",
        "info": "Calcium is the top mineral when it comes to your bones. This mineral helps build strong bones, so you can do everything from standing up straight to scoring that winning goal. It also helps build strong, healthy teeth, for chomping on tasty food.",
        "display": true,
        "alert": false,
        "warning": false,
        "range": [15, 60],
        "units": "mcg/dL",
        "requirementsMen" : "1,000 mg/day",
        "requirementsWomen" : "1,000 mg/day",
        "suggestions" : "Dairy products, such as cheese, milk and yogurt. Dark green leafy vegetables, such as broccoli and kale. Fish with edible soft bones, such as sardines and canned salmon. Calcium-fortified foods and beverages, such as soy products, cereal and fruit juices, and milk substitutes."

    },
    "Choline":{
        "key": "2",
        "name": "Choline",
        "info": "Choline is a source of methyl groups needed for many steps in metabolism. The body needs choline to synthesize phosphatidylcholine and sphingomyelin, two major phospholipids vital for cell membranes.",
        "display": true,
        "alert": false,
        "warning": false,
        "range": [8, 18],
        "units": "U/mL",
        "requirementsMen" : "450 mg/day",
        "requirementsWomen" : "425 mg/day",
        "suggestions" : "You can get recommended amounts of choline by eating a variety of foods, including the following: Meat, eggs, poultry, fish, and dairy products. Potatoes and cruciferous vegetables such as brussels sprouts, broccoli, and cauliflower. Some types of beans, nuts, seeds, and whole grains."
    },
    "Iron":{
        "key": "3",
        "name": "Iron",
        "info": "The body needs iron to make hemoglobin (say: HEE-muh-glo-bun). Hemoglobin is the part of your red blood cells that carries oxygen from your lungs to the rest of your body. Your entire body needs oxygen to stay healthy and alive.",
        "display": true,
        "alert": false,
        "warning": false,
        "range": [60, 170],
        "units": "mcg/dL",
        "requirementsMen" : "8.7 mg/day",
        "requirementsWomen" : "14.8 mg/day",
        "suggestions" : "The richest sources of heme iron in the diet include lean meat and seafood. Dietary sources of nonheme iron include nuts, beans, vegetables, and fortified grain products."
    },
    "Magnesium":{
        "key": "4",
        "name": "Magnesium",
        "info": "Magnesium is a mineral that helps muscles, nerves, the immune system, and the heart work as they should. It also helps make protein and energy, and helps keep bones strong.",
        "display": true,
        "alert": false,
        "warning": false,
        "range": [1.7, 2.2],
        "units": "mg/dL",
        "requirementsMen" : "400 mg/day",
        "requirementsWomen" : "310 mg/day",
        "suggestions" : "Whole grains and dark-green, leafy vegetables are good sources of magnesium. Low-fat milk and yogurt contain magnesium as well\nDried beans and legumes (such as soybeans, baked beans, lentils, and peanuts) and nuts (such as almonds and cashews) provide magnesium."
    },
    "Phosphorus":{
        "key": "5",
        "name": "Phosphorus",
        "info": "Phosphorus is a mineral that helps in the formation of bones and teeth. It also helps make protein and energy, and helps keep muscles and nerves working the way they should.",
        "display": true,
        "alert": false,
        "warning": false,
        "range": [2.8, 4.5],
        "units": "mg/dL",
        "requirementsMen" : "4000mg",
        "requirementsWomen" : "4000mg",
        "suggestions" : "Dairy products, such as yogurt, milk, and cheese\nGrain products, such as bread, tortillas, brown rice, and oatmeal.\nMeats, poultry, fish, and eggs.\nNuts and seeds, such as cashews and sesame seeds."
    },
    "Potassium":{
        "key": "6",
        "name": "Potassium",
        "info": "Potassium (say: puh-TAH-see-um) keeps your muscles, heart, and nervous system working properly.",
        "display": true,
        "alert": false,
        "warning": false,
        "range": [3.6, 5.2],
        "units": "mmol/L",
        "requirementsMen" : "1600 mg/day",
        "requirementsWomen" : "1600 mg/day",
        "suggestions" : "Many fruits and vegetables are excellent sources, as are some legumes (e.g., soybeans) and potatoes. Meats, poultry, fish, milk, yogurt, and nuts also contain potassium"
    },
    "Sodium":{
        "key": "7",
        "name": "Sodium",
        "info": "A mineral needed by the body to keep body fluids in balance. Sodium is found in table salt and in many processed foods. Too much sodium can cause the body to retain water.",
        "display": true,
        "alert": false,
        "warning": false,
        "range": [135, 145],
        "units": "mEq/L",
        "requirementsMen" : "3400 mg/day",
        "requirementsWomen" : "3400 mg/day",
        "suggestions" : "However, the Dietary Guidelines for Americans recommends adults limit sodium intake to less than 2,300 mg per day—that's equal to about 1 teaspoon of table salt! For children under age 14, recommended limits are even lower."
    },
    "A" : {
        "key": "8",
        "name": "Vitamin A",
        "info": "This vitamin plays a really big part in eyesight. It's great for night vision, like when you're trick-or-treating on Halloween. Vitamin A helps you see in color, too, from the brightest yellow to the darkest purple. In addition, it helps your body fight infections by boosting your immune system.",
        "display": true,
        "alert": false,
        "warning": false,
        "range": [15, 60],
        "units": "mcg/dL",
        "requirementsMen" : "900 mcg/day",
        "requirementsWomen" : "700 mcg/day",
        "suggestions" : "You can also get vitamin A by including good sources of beta-carotene in your diet, as the body can convert this into retinol. The main food sources of beta-carotene are: yellow, red and green (leafy) vegetables, such as spinach, carrots, sweet potatoes and red peppers. yellow fruit, such as mango, papaya and apricots."
    },
    "C" : {
        "key": "9",
        "name": "Vitamin C",
        "info": "This vitamin is important for keeping body tissues, such as gums, bones, and blood vessels in good shape. Vitamin C is key if you get a cut because it helps you heal. It also helps the body absorb iron from food. Kids need iron to prevent anemia. This vitamin may also help your body fight off infections. If you get a cold, for instance, vitamin C can help shorten the amount of time you are sick.",
        "display": true,
        "alert": false,
        "warning": false,
        "range": [0.4, 2],
        "units": "mg/dL",
        "requirementsMen" : "90 mg/day",
        "requirementsWomen" : "75 mg/day",
        "suggestions" : "Fruits and vegetables are the best natural sources of vitamin C. More specifically, citrus fruits like oranges, kiwi, lemon and grapefruit, cruciferous vegetables such as broccoli, brussels sprouts, cabbage and cauliflower, bell peppers, strawberries, tomatoes and white potatoes."
    },
    "D" : {
        "key": "10",
        "name": "Vitamin D",
        "info": "No bones about it . . . vitamin D is the vitamin you need for strong bones! It's also great for forming strong teeth. Vitamin D lends a hand to an important mineral — it helps your body absorb the calcium it needs. Vitamin D is made in the skin when exposed to sunlight, or you can get it from the foods you eat.",
        "display": true,
        "alert": false,
        "warning": false,
        "range": [20, 40],
        "units": "ng/mL",
        "requirementsMen" : "20 mcg/day",
        "requirementsWomen" : "20 mcg/day",
        "suggestions" : "The Recommended Dietary Allowance for adults 19 years and older is 600 IU (15 mcg) daily for men and women, and for adults >70 years it is 800 IU (20 mcg) daily. UL: The Tolerable Upper Intake Level is the maximum daily intake unlikely to cause harmful effects on health."
    },
    "E" : {
        "key": "11",
        "name": "Vitamin E",
        "info": "Everybody needs E. This hard-working vitamin protects your cells and tissues from damage. It is also important for the health of red blood cells.",
        "display": true,
        "alert": false,
        "warning": false,
        "range": [5.5, 17],
        "units": "mcg/mL",
        "requirementsMen" : "15 mg/day",
        "requirementsWomen" : "19 mg/day",
        "suggestions" : "The Recommended Dietary Allowance (RDA) for vitamin E for males and females ages 14 years and older is 15 mg daily (or 22 international units, IU), including women who are pregnant. Lactating women need slightly more at 19 mg (28 IU) daily."
    },
    "K" : {
        "key": "12",
        "name": "Vitamin K",
        "info": "Vitamin K is the clotmaster! Remember the last time you got a cut? Your blood did something special called clotting. This is when certain cells in your blood act like glue and stick together at the surface of the cut to help stop the bleeding.",
        "display": true,
        "alert": false,
        "warning": false,
        "range": [0.2, 3.2],
        "units": "ng/mL",
        "requirementsMen" : "120 mcg/day",
        "requirementsWomen" : "120 mcg/day",
        "suggestions" : "Green leafy vegetables, such as spinach, kale, broccoli, and lettuce.\nVegetable oils.\nSome fruits, such as blueberries and figs.\nMeat, cheese, eggs, and soybeans."
    },
    "Zinc":{
        "key": "13",
        "name": "Zinc",
        "info": "Zinc helps your immune system, which is your body's system for fighting off illnesses and infections. It also helps with cell growth and helps heal wounds, such as cuts.",
        "display": true,
        "alert": false,
        "warning": false,
        "range": [60, 130],
        "units": "mcg/dL",
        "requirementsMen" : "11 mg/day",
        "requirementsWomen" : "8 mg/day",
        "suggestions" : "Includes a variety of vegetables, fruits, whole grains, fat-free or low-fat milk and milk products, and oils. ...\nIncludes a variety of protein foods, including seafood, lean meats and poultry, eggs, legumes (beans and peas), nuts, seeds, and soy products."
    }
}
